
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Юзеры.УчетнаяЗаписьГостевая() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Go(Команда)
	Если ПустаяСтрока(ИмяПользователя) Тогда
		ПроверитьЗаполнение();
	ИначеЕсли Юзеры.Ключник(ИмяПользователя, Пароль) Тогда
		Юзеры.УстановитьПараметрСеансаТекущийПользователь(ИмяПользователя);
		Оповестить("Авторизация");
		//ОбновитьИнтерфейс();
		//ЭтаФорма.Ширина = 0;
		ЗавершитьРаботуСистемы(Ложь, Истина, "/N" + ИмяПользователя);
	КонецЕсли;
	ИмяПользователя	= "";
	Пароль			= "";
КонецПроцедуры
