
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Юзеры.УчетнаяЗаписьГостевая() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Go(Команда)
	Если ПустаяСтрока(ИмяПользователя) Тогда
		ПроверитьЗаполнение();
	ИначеЕсли Регистрация Тогда
		Если ПустаяСтрока(Пароль) Или ПустаяСтрока(ПарольПовторно) Тогда
			Сообщить("Пароль не может быть пустым", СтатусСообщения.Важное);
		ИначеЕсли Пароль = СокрЛП(Пароль) И Пароль = ПарольПовторно Тогда
			Сообщить("Регистрация на сайте временно запрещена", СтатусСообщения.Внимание);
		Иначе
			Сообщить("Пароли не совпадают", СтатусСообщения.Важное);
		КонецЕсли;
	ИначеЕсли Юзеры.Ключник(СокрЛП(ИмяПользователя), Пароль) Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина, "/N" + ИмяПользователя + " /P" + Пароль);
	Иначе
		Предел = ТекущаяДата() + Шагомер * 15;
		Пока ТекущаяДата() < Предел Цикл
		КонецЦикла;
		Попытка
			Шагомер = Шагомер + 1;
		Исключение
			Шагомер = 0;
			ОчиститьСообщения();
		КонецПопытки;
	КонецЕсли;
	ИмяПользователя	= "";
	Пароль			= "";
	ПарольПовторно	= "";
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПриИзменении(Элемент)
	Элементы.ПарольПовторно.Видимость = Регистрация;
КонецПроцедуры
