
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Юзеры.УчетнаяЗаписьГостевая() Тогда
		Отказ = Истина;
	ИначеЕсли Объект.Владелец.Пустая() Тогда
		Отказ = Истина;
	ИначеЕсли Тесты.ОценкаИспользован(Объект.Ссылка) Тогда
		Элементы.Наименование.ТолькоПросмотр	= Истина;
		Элементы.Результат.ТолькоПросмотр		= Истина;
		//КонецЕсли;
	КонецЕсли;
	//Параметры.ЗначенияЗаполнения
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Оценки", Объект.Владелец);
КонецПроцедуры
