
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Классы.Наименование КАК Наименование
		                      |ИЗ
		                      |	Справочник.Классы КАК Классы
		                      |ГДЕ
		                      |	Классы.Родитель = &Родитель
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Наименование УБЫВ");
		Запрос.УстановитьПараметр("Родитель",	Объект.Родитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.Наименование = Лев(Выборка.Наименование, СтрДлина(Выборка.Наименование) - 1) + Символ(КодСимвола(Прав(Выборка.Наименование, 1)) + 1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Уровень) Тогда
		Гугл = УчебныйПроцесс.УровеньНайти(Объект.Наименование);
		Если ЗначениеЗаполнено(Гугл) Тогда
			Объект.Уровень = Гугл;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
