
Функция ПользовательУстановить()
	Попытка
		//УстановитьПривилегированныйРежим(Истина);
		ТекущийПользователь = Юзеры.ТекущийПользователь();
		Пользователь		= ТекущийПользователь.Наименование;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Функция КалендарьСобытийПолучить(ДатаНач, ДатаКон, НомерПоля=0)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	НАЧАЛОПЕРИОДА(КалендарьСобытий.Период, ДЕНЬ) КАК Период
	                      |ИЗ
	                      |	РегистрСведений.КалендарьСобытий КАК КалендарьСобытий
	                      |ГДЕ
	                      |	КалендарьСобытий.Период МЕЖДУ &ДатаНач И &ДатаКон
	                      |	И КалендарьСобытий.Пользователь В(&Пользователи)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период");
	Если НомерПоля = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	КалендарьСобытий.Комментарий КАК Комментарий,
		               |	КалендарьСобытий.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.КалендарьСобытий КАК КалендарьСобытий
		               |ГДЕ
		               |	КалендарьСобытий.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И КалендарьСобытий.Пользователь В(&Пользователи)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНач",		НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон",		КонецДня(ДатаКон));
	мЮзеры = Новый Массив;
	мЮзеры.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если НЕ Юзеры.УчетнаяЗаписьГостевая() Тогда
		мЮзеры.Добавить(ТекущийПользователь);
	КонецЕсли;
	Запрос.УстановитьПараметр("Пользователи",	мЮзеры);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПользовательУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		////первый запуск
		Если ?(Юзеры.УчетнаяЗаписьГостевая(), Истина, НЕ ЗначениеЗаполнено(Календарь) Или Юзеры.ПервыйЗапуск(ТекущийПользователь)) Тогда
			Сообщить("Добро пожаловать в Негосударственный центр тестирования");
		КонецЕсли;
		Календарь = ТекущаяДата();
		Элементы.Календарь.НачалоПериодаОтображения = НачалоМесяца(?(День(Календарь) > 9, Календарь, ДобавитьМесяц(Календарь, -1)));
		Элементы.Календарь.КонецПериодаОтображения	= КонецМесяца(ДобавитьМесяц(Календарь, 5));
		КалендарьЗаполнить();
	Иначе
		//Предупреждение("pro blema");
		Отказ = Истина;
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КалендарьСобытий" Тогда
		КалендарьЗаполнить();
	//ИначеЕсли ИмяСобытия = "Авторизация" Тогда
	//	ПользовательУстановить();
	//	КалендарьЗаполнить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьЗаполнить()
	Сегодня	= НачалоДня(ТекущаяДата());
	Даты = КалендарьСобытийПолучить(Элементы.Календарь.НачалоПериодаОтображения, Элементы.Календарь.КонецПериодаОтображения);
	Для Каждого Дата Из Даты Цикл
		Если Дата = Сегодня Тогда
			Описания = КалендарьСобытийПолучить(Сегодня, Сегодня, 1);
			Если Описания.Количество() > 0 Тогда
				ОчиститьСообщения();
				ПетрП = Истина;
				Для Каждого Описание Из Описания Цикл
					Если ПетрП Тогда
						ПетрП = Ложь;
						Сообщить("Сегодня: ");
					КонецЕсли;
					Сообщить(Описание);
				КонецЦикла;
			КонецЕсли;
		Иначе
			Элементы.Календарь.ВыделенныеДаты.Добавить(Дата);
		КонецЕсли;
	КонецЦикла;
	Элементы.Календарь.ВыделенныеДаты.Добавить(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура КалендарьВыбор(Элемент, ВыбраннаяДата)
	Твит = "";
	Описания = КалендарьСобытийПолучить(ВыбраннаяДата, ВыбраннаяДата, 1);
	Для Каждого Описание Из Описания Цикл
		Твит = Формат(ВыбраннаяДата, "ДЛФ=DD");
		Если НЕ ПустаяСтрока(Описание) Тогда
			Сообщить(Твит + "  " + Описание);
		КонецЕсли;
	КонецЦикла;
	Если НЕ ПустаяСтрока(Твит) Тогда
		КалендарьЗаполнить();
	КонецЕсли;
КонецПроцедуры
