
Процедура ПередЗаписью(Отказ)
	Если (ЗначениеЗаполнено(ДатаНачала) Или ЗначениеЗаполнено(ДатаОкончания)) И ДатаНачала > ДатаОкончания Тогда
		Отказ = Истина;
	Иначе
		Классы.Свернуть("Класс");
		Предметы.Свернуть("Предмет");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование	= ОбъектКопирования.Наименование;
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаОкончания) Тогда
		ДатаОкончания = ДобавитьМесяц(ОбъектКопирования.ДатаОкончания, 12);
		Если Найти(Наименование, Формат(ОбъектКопирования.ДатаОкончания, "ДФ=yyyy")) > 0 Тогда
			Наименование = СтрЗаменить(Наименование, Формат(ОбъектКопирования.ДатаОкончания, "ДФ=yyyy"), Формат(ДатаОкончания, "ДФ=yyyy"));
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаНачала) Тогда
		ДатаНачала = ДобавитьМесяц(ОбъектКопирования.ДатаНачала, 12);
		Если Найти(Наименование, Формат(ОбъектКопирования.ДатаНачала, "ДФ=yyyy")) > 0 Тогда
			Наименование = СтрЗаменить(Наименование, Формат(ОбъектКопирования.ДатаНачала, "ДФ=yyyy"), Формат(ДатаНачала, "ДФ=yyyy"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
