
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Вопросы", Объект.Владелец);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Юзеры.УчетнаяЗаписьГостевая() Тогда
		Отказ = Истина;
	ИначеЕсли Объект.Владелец.Пустая() Тогда
		Отказ = Истина;
	ИначеЕсли Объект.Ссылка.Пустая() Тогда
		Если Параметры.ЗначенияЗаполнения.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
		КонецЕсли;
		Если Объект.Код = 0 Тогда
			Объект.Код = Тесты.ПолучениеНовогоКода(Объект.Владелец);
		КонецЕсли;
	ИначеЕсли Тесты.ОтветИспользован(Объект.Ссылка) Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.Вес.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Весы = Тесты.ВесыПоВопросу(Объект.Владелец);
	Пока Весы.Следующий() Цикл
		Элементы.Вес.СписокВыбора.Добавить(Весы.Вес);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("Вопросы", Объект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
