
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Тесты") Тогда
		Если Тесты.ТестДоступен(ДанныеЗаполнения) Тогда
			Тест = ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РезультатыТестирования
	Движения.РезультатыТестирования.Записывать = Истина;
	//Для Каждого ТекСтрокаВопросы Из Вопросы Цикл
		Движение = Движения.РезультатыТестирования.Добавить();
		Движение.Период = Дата;
		Движение.Тест = Тест;
		Движение.ФизЛицо = Учащийся;
		//Движение.Оценка = 1;
	//КонецЦикла;

	// регистр ОтветыПриТестировании 
	Движения.ОтветыПриТестировании.Записывать = Истина;
	Для Каждого ТекСтрокаВопросы Из Вопросы Цикл
		Движение = Движения.ОтветыПриТестировании.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаВопросы);
		Движение.Период		= Дата;
		//Движение.Тест		= Тест;
		Движение.ФизЛицо	= Учащийся;
		//Движение.Вопрос		= ТекСтрокаВопросы.Вопрос;
		//Движение.Ответ		= ТекСтрокаВопросы.Ответ;
		//Движение.Результат	= ТекСтрокаВопросы.Результат;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Дата				= Дата(1,1,1);
	Учащийся			= Юзеры.ТекущийПользователь();
	Оценка				= Неопределено;
	ЗатраченоВремени	= 0;
	Комментарий			= "";
	
	Вопросы.Очистить();
	Ответы.Очистить();
КонецПроцедуры
