
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ=Истина, СтатусСообщения=Неопределено) Экспорт
	Отказ = Истина;
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		Сообщить(ТекстСообщения, СтатусСообщения);
	КонецЕсли;
КонецПроцедуры

Функция ФИО(Знач ФамиляиИмяОтчество) Экспорт
	Ответ = ФамиляиИмяОтчество;
	Если НЕ ПустаяСтрока(ФамиляиИмяОтчество) Тогда
		Если СтрЧислоВхождений(ФамиляиИмяОтчество, ".") > 0 Тогда
		//И СтрЧислоВхождений(ФамиляиИмяОтчество, " ") = 0 Тогда
			ФИО		= СтрРазделить(ФамиляиИмяОтчество, " ", Ложь);
			Ответ	= "";
			Для Каждого Слово Из ФИО Цикл
				Если ПустаяСтрока(Ответ) Тогда
					Ответ = Слово;
				Иначе
					Ответ = Ответ + " " + Лев(Слово, 1) + ".";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат СокрЛП(Ответ);
КонецФункции
