
Функция УровеньНайти(Слово) Экспорт
	Ответ = Неопределено;
	//Выборка = Справочники.Уровни.Выбрать();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Уровни.Ссылка,
	                      |	Уровни.Наименование
	                      |ИЗ
	                      |	Справочник.Уровни КАК Уровни
	                      |ГДЕ
	                      |	Уровни.ПометкаУдаления = ЛОЖЬ
	                      |	И &Наименование ПОДОБНО ""%"" + Уровни.Наименование + ""%""");
	Запрос.УстановитьПараметр("Наименование",	Слово);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() И Ответ = Неопределено Цикл
		Если Найти(НРег(Слово), НРег(Выборка.Наименование)) > 0 Тогда
			Ответ = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Процедура УровниЗаполнить() Экспорт
	Для Итератор = 1 По 11 Цикл
		ТекКод	= Строка(Итератор);
		Если Справочники.Уровни.НайтиПоКоду(ТекКод).Пустая() Тогда
			ТекОбъект = Справочники.Уровни.СоздатьЭлемент();
			ТекОбъект.Код			= ТекКод;
			ТекОбъект.Наименование	= ТекОбъект.Код + " класс";
			ТекОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
