
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизЛица") И НЕ ДанныеЗаполнения.ЭтоГруппа Тогда
		Наименование= ДанныеЗаполнения.Наименование;
		ФизЛицо		= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Предметы") Тогда
		Если ДанныеЗаполнения.ЭтоГруппа Тогда
			Выборка = Справочники.Предметы.Выбрать(ДанныеЗаполнения, ,);
			Пока Выборка.Следующий() Цикл
				Заполнить(Выборка.Ссылка);
			КонецЦикла;
		Иначе
			ТекСтрока = Предметы.Добавить();
			ТекСтрока.Предмет	= ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(Предмет) И Предметы.Количество() > 0 Тогда
		Предмет = Предметы[0].Предмет;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ФизЛицо	= Неопределено;
КонецПроцедуры
