
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Вопросы.Наименование
	                      |ИЗ
	                      |	Справочник.Вопросы КАК Вопросы
	                      |ГДЕ
	                      |	Вопросы.Владелец = &Владелец
	                      |	И Вопросы.Наименование = &Наименование
	                      |	И Вопросы.Ссылка <> Вопросы.Ссылка");
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Если Ссылка.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Вопросы.Наименование
		               |ИЗ
		               |	Справочник.Вопросы КАК Вопросы
		               |ГДЕ
		               |	Вопросы.Владелец = &Владелец
		               |	И Вопросы.Наименование = &Наименование";
	КонецЕсли;
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Вопрос дублируется", Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ Владелец.СквозныеОтветы Тогда
		//ПроверяемыеРеквизиты.Добавить("ВариантыОтветов");
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если Тесты.ВопросИспользован(Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
