
Процедура ПередУдалением(Отказ)
	Если Тесты.ОтветИспользован(Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВариантыОтветов.Наименование
	                      |ИЗ
	                      |	Справочник.ВариантыОтветов КАК ВариантыОтветов
	                      |ГДЕ
	                      |	ВариантыОтветов.Владелец = &Владелец
	                      |	И ВариантыОтветов.Наименование = &Наименование
	                      |	И ВариантыОтветов.Ссылка <> ВариантыОтветов.Ссылка");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Если Ссылка.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВариантыОтветов.Наименование
		               |ИЗ
		               |	Справочник.ВариантыОтветов КАК ВариантыОтветов
		               |ГДЕ
		               |	ВариантыОтветов.Владелец = &Владелец
		               |	И ВариантыОтветов.Наименование = &Наименование";
	КонецЕсли;
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Ответ дублируется", Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
