
Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(Родитель) Тогда
		Уровень = Родитель.Уровень;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Классы.Ссылка
	                      |ИЗ
	                      |	Справочник.Классы КАК Классы
	                      |ГДЕ
	                      |	Классы.Наименование = &Наименование
	                      |	И Классы.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Если ЭтоГруппа Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Группа с таким названием уже существует", Отказ);
		КонецЕсли;
	Иначе
		//Запрос.Текст = "ВЫБРАТЬ
		//			   |	Классы.Ссылка
		//			   |ИЗ
		//			   |	Справочник.Классы КАК Классы
		//			   |ГДЕ
		//			   |	Классы.Родитель = &Родитель
		//			   |	И Классы.Наименование = &Наименование
		//			   |	И Классы.Ссылка <> &Ссылка";
		//Запрос.УстановитьПараметр("Родитель",		Родитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Класс с таким названием уже существует", Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтоГруппа Тогда
		Выборка = Справочники.Классы.Выбрать(Ссылка);
		Пока Выборка.Следующий() Цикл
			Если Выборка.Уровень <> Уровень Тогда
				Объект = Выборка.ПолучитьОбъект();
				Объект.Уровень = Уровень;
				Объект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтоГруппа Тогда
		//ПроверяемыеРеквизиты.Добавить("Уровень");
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Классы.Ссылка
		                      |ИЗ
		                      |	Справочник.Классы КАК Классы
		                      |ГДЕ
		                      |	Классы.ЭтоГруппа = ИСТИНА
		                      |	И Классы.ПометкаУдаления = ЛОЖЬ");
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ПроверяемыеРеквизиты.Добавить("Родитель");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
